// ===================================================
// СТР 1  ОКНО ПРИВЕТСТВИЯ (нажать кнопку продолжить)
// ===================================================
helloMessage();
createBigShark();
// ===================================================
// СTP 2  ПОКАЗЫВАЕТ ИНСТРУКЦИИ (нажать кнопку начать спуск)
// ===================================================
function showinstructions() {
	instructions();
}

// ===================================================
// СТР 3 ПОКАЗЫВАЕТ ОСНОВНОЕ ИГРОВОЕ ПОЛЕ
// ===================================================
function startGame() {
	gamestatus == "game_on";
	// удаляем блок с инструкциями (2 стр)
	instructionsBlockremove();
	// создаем игровое поле
	mainfield();
	// создаем всех рыб
	createAllFish();
	// создаем и запускаем таймер
	createTimer();
	timerGo();
	// создаем жизни
	createLifes();
	// создание пузырьков
	allBubblesCreate();
	// создание водолаза
	createHero();
	// якорь
	createAncor();
}
// ===================================================
// СТР 4 ПОКАЗЫВАЕТ ОКНО ПОБЕДЫ
// ===================================================
function winGame() {
	// МЕНЯЕМ СТАТУС ИГРЫ ДЛЯ ОКЛЮЧЕНИЯ СРАБОТКИ GAMEOVER
	gamestatus == "game_win";
	// удаляем главное поле
	mainfield.remove();
	// Победное окно с поздравлением
	winwindowshow();
	// Анимация победного сообщения-2
	createMess2();
}